10/data/attachments/6ced59dd7d78793c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_dc85437c-9bba-43d5-9f74-b4dffd5b443a</nif:username>
            <nif:friendToBeAdded>Jeffery_wear_Friend_31940_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>